Repository: Gml-Launcher/Gml.Launcher
Catalog: src/Gml.Launcher/Assets/Resources/Resources.*.resx
Languages: ru, uk_ua, zh

# AuthButtonText
source: Sign in
ru: АВТОРИЗОВАТЬСЯ
uk_ua: увiйти
zh: 登录

source: Login
ru: Логин
uk_ua: Логін
zh: 登录

source: Password
ru: Пароль
uk_ua: Пароль
zh: 密码

source: Play
ru: ИГРАТЬ
uk_ua: грати
zh: 玩

source: Settings
ru: НАСТРОЙКИ
uk_ua: налаштування
zh: 设置

source: Mods list
ru: Список модов
uk_ua: Список модів
zh: 模组列表

source: Website
ru: НАШ САЙТ
uk_ua: наш сайт
zh: 我们的网站

source: Error
ru: Ошибка
uk_ua: Помилка
zh: 错误

# InvalidAuthData
source: Auth error
ru: Ошибка авторизации
uk_ua: Помилка авторизації
zh: 授权错误

# LostConnection
source: Lost connection to server
ru: Потеряно соединение с сервером
uk_ua: Втрачено з’єднання з сервером
zh: 与服务器失去连接

source: Reconnecting....
ru: Переподключение...
uk_ua: Повторне підключення...
zh: 重新连接中...

source: BACK
ru: НАЗАД
uk_ua: НАЗАД
zh: 返回

# Cabinet
source: Profile
ru: Личный кабинет
uk_ua: Особистий кабінет
zh: 个人账户

source: Profile not configured
ru: Профиль не настроен, запуск текущего клиента не доступен
uk_ua: Профіль не налаштовано, запуск поточного клієнта недоступний
zh: 配置未设置，当前客户端无法启动

# SettingsRamTitle
source: Settings RAM
ru: Настройки ОЗУ
uk_ua: Налаштування ОЗП
zh: RAM设置

# SettingsRamDescription
source: Configure the amount of RAM consumed.
ru: Настройте объем потребляемой оперативной памяти
uk_ua: Налаштуйте обсяг оперативної пам’яті
zh: 设置内存使用量

# DynamicValue
source: Auto
ru: Автоматически
uk_ua: Автоматично
zh: 自动

source: Full screen
ru: Полноэкранный режим
uk_ua: Повноекранний режим
zh: 全屏模式

source: Window size
ru: Размеры окна
uk_ua: Розміри вікна
zh: 窗口尺寸

# UnitMb
source: MB
ru: Мб
uk_ua: МБ

# NotSetting
source: Failed to get launch settings. Please go to the client settings and try again.
ru: Не удалось получить настройки запуска. Перейдите в настройки клиента и повторите попытку
uk_ua: Не вдалося отримати налаштування запуску. Перейдіть до налаштувань клієнта та спробуйте ще раз.
zh: 无法获取启动设置。请前往客户端设置并重试

source: Updating
ru: Обновление
uk_ua: Оновлення
zh: 更新

# UpdatingDescription
source: Retrieving updates
ru: Получение обновлений
uk_ua: Отримання оновлень
zh: 获取更新

source: Checking file integrity
ru: Проверка целостности файлов
uk_ua: Перевірка цілісності файлів
zh: 文件完整性检查

source: Launching
ru: Запуск
uk_ua: Запуск
zh: 启动

# PreparingLaunch
source: Preparing to launch...
ru: Подготовка к запуску...
uk_ua: Підготовка до запуску...
zh: 准备启动中...

source: Available
ru: Доступен
uk_ua: Доступний
zh: 可用

# DefaultDRpcText
source: Sits in the launcher
ru: Сидит в лаунчере
uk_ua: Знаходиться в лаунчері
zh: 在启动器中

# PlayDRpcText
source: Play in
ru: Играет в
uk_ua: Грає в
zh: 玩

# CheckUpdates
source: Checking for updates
ru: Проверка обновлений
uk_ua: Перевірка оновлень
zh: 更新检查

source: Installing updates
ru: Установка обновлений
uk_ua: Встановлення оновлень
zh: 安装更新

# FailedOs
source: Failed to determine the operating system
ru: Не удалось определить операционную систему
uk_ua: Не вдалося визначити операційну систему
zh: 无法确定操作系统

source: On servers
ru: На серверах
uk_ua: На серверах
zh: 在服务器上

# PlayersShort
source: pl.
ru: чел.
uk_ua: грав.
zh: 人

# JavaNotFound
source: Unable to detect a loaded Java for your operating system, please contact support or the project administrator.
ru: Не удалось обнаружить загруженную Java для Вашей операционной системы, обратитесь в поддержку или к администратору проекта
uk_ua: Не вдалося виявити завантажену Java для вашої операційної системи, зверніться до підтримки або адміністратора проєкту
zh: 无法为您的操作系统找到已下载的Java，请联系支持或项目管理员

# InstallationDirectory
source: Install folder
ru: Папка установки
uk_ua: Тека встановлення
zh: 安装文件夹

# Edit
source: Change
ru: Изменить
uk_ua: Змінити
zh: 修改

source: Stay
ru: Осталось
uk_ua: Залишилось
zh: 剩余

source: files
ru: файлов
uk_ua: файлів
zh: 文件

# InvalidFolder
source: Failed to change the installation folder or an error occurred while changing the folder.
ru: Не получилось сменить папку установки или произошла ошибка при смене папки
uk_ua: Не вдалося змінити теку встановлення або сталася помилка під час зміни
zh: 无法更改安装文件夹或更改文件夹时发生错误

# IsDiskFull
source: Not enough disk space
ru: Недостаточно места на диске
uk_ua: Недостатньо місця на диску
zh: 磁盘空间不足

# GameProfileError
source: Error initializing the game profile.
ru: Ошибка инициализации игрового профиля.
uk_ua: Помилка ініціалізації ігрового профілю.
zh: 游戏配置初始化错误

# InvalidSession
source: Your game session in the launcher has expired, please log in again.
ru: Ваша игровая сессия в лаунчере истекла, авторизуйтесь заново
uk_ua: Ваша ігрова сесія в лаунчері завершилася, увійдіть знову
zh: 您在启动器中的游戏会话已过期，请重新登录

# VpnUse
source: You are using a VPN connection, which may negatively affect connection quality and game client downloads. Please disable the VPN while running the launcher.
ru: Вы используете VPN подключение, это может негативно влиять на качество соединения и загрузку игровых клиентов. Отключите VPN на время работы лаунчера.
uk_ua: Ви використовуєте VPN-з’єднання, це може негативно впливати на якість з’єднання та завантаження ігрових клієнтів. Вимкніть VPN на час роботи лаунчера.
zh: 您正在使用VPN连接，这可能会对连接质量和游戏客户端下载产生不良影响。请在启动器工作期间关闭VPN。

source: Information
ru: Информация
uk_ua: Інформація
zh: 信息

# ModsListDescription
source: On this page, you can view the list of modifications and select the ones you are interested in. You can dynamically enable or disable them at any time.
ru: На данной странице вы можете просмотреть список модификаций, и выбрать интересующие вас, можете динамично включать и выключать в любое время
uk_ua: На цій сторінці ви можете переглянути список модифікацій і вибрати ті, що вас цікавлять. Ви можете динамічно вмикати та вимикати їх у будь-який момент.
zh: 在此页面，您可以查看修改列表并选择您感兴趣的内容。您可以随时动态启用或禁用它们。

source: Success
ru: Успешно
uk_ua: Успішно
zh: 成功

# ModEnabled
source: The mod has been successfully enabled
ru: Мод успешно включен
uk_ua: Мод успішно увімкнено
zh: 修改已成功启用

# ModDisabled
source: The mod has been successfully disabled
ru: Мод успешно выключен
uk_ua: Мод успішно вимкнено
zh: 修改已成功禁用

# ModsEmpty
source: There are no optional mods available for this profile. If you have any suggestions, please notify the administration.
ru: Для данного профиля нет опциональных модов, если у вас есть предложения, оповестите об этом администрацию
uk_ua: Для цього профілю немає доступних опціональних модів. Якщо маєте пропозиції — повідомте адміністрацію.
zh: 此配置文件没有可选模块。如果您有任何建议，请通知管理员。

source: Empty
ru: Пусто
uk_ua: Порожньо
zh: 空

# MinecraftExceptionStartException
source: An error occurred during the game. The administration has already received the details of your error.
ru: Произошла ошибка во время работы игры. Администрация уже получила детали вашей ошибки.
uk_ua: Під час гри сталася помилка. Адміністрація вже отримала деталі вашої помилки.
zh: 游戏运行时发生错误。管理员已收到您的错误详情。

source: News
ru: Новости
uk_ua: Новини
zh: 新闻

# BackendChecking
source: Checking the server
ru: Проверка сервера
zh: 检查服务器

# SentrySDKInit
source: Initializing Sentry SDK
ru: Инициализация Sentry SDK
zh: 初始化Sentry SDK

# BackendCheckingLonger
source: Still checking the server
ru: Всё еще проверка сервера
zh: 还在检查服务器

# OfflineDescription
source: There is no access to the server. The launcher works offline. To exit offline mode, make sure that the server is available, and then restart the launcher.
ru: Нет доступа к серверу. Лаунчер работает в оффлайн режиме. Чтобы выйти из этого режима - убедитесь, что сервер работает и перезапустите лаунчер
zh: 没有对服务器的访问。 启动器脱机工作。 要退出此模式，请确保服务器正在运行并重新启动程序。

source: Offline mode
ru: Оффлайн режим
zh: 离线模式

# CheckBackendButton
source: Check the server
ru: Проверить сервер
zh: 检查服务器

# CheckBackendMessage
source: Checking the availability of the server, please wait
ru: Проверка доступности сервера, пожалуйста подождите
zh: 检查服务器的可用性，请稍候

# CheckBackendResultFailed
source: Server is offline right now. Try again later
ru: Сервер сейчас недоступен. Повторите попытку позже
zh: 服务器当前不可用. 请稍后再试。

# CheckBackendResultSuccessful
source: Server is online. You need to restart the launcher to turn off offline mode
ru: Сервер доступен. Перезапустите лаунчер чтобы выключить оффлайн режим
zh: 服务器可用。 重新启动启动器以关闭脱机模式

# CheckBackendTitle
source: Checking the server
ru: Проверка сервера
zh: 检查服务器

# RestartButton
source: Restart
ru: Перезапустить
zh: 重新启动

# NewsOffline
source: Unable to load news
ru: Невозможно загрузить новости
zh: 无法上传新闻

# NewsEmptyTitle
source: There is no news right now
ru: Сейчас новостей нет
zh: 现在没有消息

# NewsEmptyContent
source: It's empty here
ru: Здесь пусто
zh: 这里空无一人

# BackendOffline
source: The server is not responding
ru: Сервер не отвечает
zh: 服务器没有响应

# TwoFactorTitle
source: Two-factor authentication
ru: 2FA аутентификация
zh: 双重身份验证

# TwoFactorDescription
source: Please enter the verification code from your authentication app.
ru: Пожалуйста, введите код подтверждения из вашего приложения аутентификации
zh: 请输入您身份验证应用中的验证码。
